# CHAPTER 03 - QUERY PRIMER

## UTILZANDO IPYTHON SQL MAGIC EXTENSION

In [62]:
# !conda install -c conda-forge ipython-sql
# !conda install sqlalchemy

In [63]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [64]:
%sql mysql+pymysql://root:minha-senha@localhost:3306/sakila

'Connected: root@sakila'

In [65]:
import sql

|Dialect|Driver|Conda Install Driver|
|:---|:---|:---|
|MySQL|PyMySQL|conda install -c anaconda pymysql|
PostgreSQL|Pyscopg2|conda install -c conda-forge psycopg2|
SQLite|Pysqlite|conda install -c prometeia pysqlite|
Oracle|Cx Oracle|conda install -c anaconda cx_oracle|
Microsoft SQL Server|Pyodbc|conda install -c conda-forge pyodbc|

## REFERÃŠNCIAS

- [How to Run and Analyze SQL Queries with Pandas in Jupyter]https://medium.com/python-in-plain-english/how-to-run-and-analyze-sql-queries-with-pandas-in-jupyter-7f02503cf46

- [Jupyter Magics with SQL - Towards Data Science](https://towardsdatascience.com/jupyter-magics-with-sql-921370099589)

- [Datacamp community](https://www.datacamp.com/community/tutorials/sql-interface-within-jupyterlab)

- https://github.com/catherinedevlin/ipython-sql

- https://docs.kyso.io/guides/sql-interface-within-jupyterlab

## QUERY MECHANICS

In [66]:
%sql SELECT first_name, last_name \
     FROM customer \
     WHERE last_name = 'ZIEGLER'

* mysql+pymysql://root:***@localhost:3306/sakila
0 rows affected.

[]

In [67]:
%sql SELECT * \
     FROM category

* mysql+pymysql://root:***@localhost:3306/sakila
16 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (6, 'Documentary', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (7, 'Drama', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (8, 'Family', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (9, 'Foreign', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (10, 'Games', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (11, 'Horror', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (12, 'Music', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (13, 'New', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (14, 'Sci-Fi', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (15, 'Sports', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (16, 'Travel', datetime.datetime(2006, 2, 15, 4, 46, 27))]

## Query Clauses

## The select Clause

In [68]:
%sql SELECT * \
     FROM language

* mysql+pymysql://root:***@localhost:3306/sakila
6 rows affected.

[(1, 'English', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (2, 'Italian', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (3, 'Japanese', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (4, 'Mandarin', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (5, 'French', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (6, 'German', datetime.datetime(2006, 2, 15, 5, 2, 19))]

In [69]:
%sql SELECT language_id, name, last_update \
     FROM language

* mysql+pymysql://root:***@localhost:3306/sakila
6 rows affected.

[(1, 'English', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (2, 'Italian', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (3, 'Japanese', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (4, 'Mandarin', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (5, 'French', datetime.datetime(2006, 2, 15, 5, 2, 19)),
 (6, 'German', datetime.datetime(2006, 2, 15, 5, 2, 19))]

In [70]:
%sql SELECT name \
     FROM language

* mysql+pymysql://root:***@localhost:3306/sakila
6 rows affected.

[('English',),
 ('Italian',),
 ('Japanese',),
 ('Mandarin',),
 ('French',),
 ('German',)]

In [71]:
%sql SELECT language_id, \
        'COMMON' language_usage, \
        language_id * 3.1415927 lang_pi_value, \
        UPPER(name) language_name \
     FROM language

* mysql+pymysql://root:***@localhost:3306/sakila
6 rows affected.

[(1, 'COMMON', Decimal('3.1415927'), 'ENGLISH'),
 (2, 'COMMON', Decimal('6.2831854'), 'ITALIAN'),
 (3, 'COMMON', Decimal('9.4247781'), 'JAPANESE'),
 (4, 'COMMON', Decimal('12.5663708'), 'MANDARIN'),
 (5, 'COMMON', Decimal('15.7079635'), 'FRENCH'),
 (6, 'COMMON', Decimal('18.8495562'), 'GERMAN')]

In [72]:
%sql SELECT version(), user(), database()

* mysql+pymysql://root:***@localhost:3306/sakila
1 rows affected.

[('8.0.23', 'root@172.17.0.1', 'sakila')]

## COLUMN ALIASES

In [73]:
%sql SELECT language_id, \
     'COMMON' AS language_usage, \
     language_id * 3.1415927 AS lang_pt_value, \
     UPPER(name) AS language_usage \
     FROM language

* mysql+pymysql://root:***@localhost:3306/sakila
6 rows affected.

[(1, 'COMMON', Decimal('3.1415927'), 'ENGLISH'),
 (2, 'COMMON', Decimal('6.2831854'), 'ITALIAN'),
 (3, 'COMMON', Decimal('9.4247781'), 'JAPANESE'),
 (4, 'COMMON', Decimal('12.5663708'), 'MANDARIN'),
 (5, 'COMMON', Decimal('15.7079635'), 'FRENCH'),
 (6, 'COMMON', Decimal('18.8495562'), 'GERMAN')]

## REMOVING DUPLICATES

In [74]:
%sql SELECT actor_id FROM film_actor ORDER BY actor_id LIMIT 10

* mysql+pymysql://root:***@localhost:3306/sakila
10 rows affected.

[(1,), (1,), (1,), (1,), (1,), (1,), (1,), (1,), (1,), (1,)]

In [75]:
%sql SELECT DISTINCT actor_id FROM film_actor ORDER BY actor_id LIMIT 10

* mysql+pymysql://root:***@localhost:3306/sakila
10 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]

## THE FROM CLAUSE

In [76]:
%sql \
SELECT CONCAT(cust.last_name, ', ', cust.first_name) full_name \
FROM \
    (SELECT first_name, last_name, email \
     FROM customer \
     WHERE first_name = 'JESSIE' \
    ) cust;

* mysql+pymysql://root:***@localhost:3306/sakila
2 rows affected.

[('BANKS, JESSIE',), ('MILAM, JESSIE',)]

## TEMPORARY TABLES

In [103]:
%sql \
    CREATE TEMPORARY TABLE actors_j \
        (actor_id smallint(5), \
        first_name varchar(45), \
        last_name varchar(45) \
    );

* mysql+pymysql://root:***@localhost:3306/sakila
0 rows affected.

[]

In [104]:
%sql \
    INSERT INTO actors_j \
    SELECT actor_id, first_name, last_name \
    FROM actor \
    WHERE last_name LIKE 'J%';

* mysql+pymysql://root:***@localhost:3306/sakila
7 rows affected.

[]

In [105]:
%sql \
    SELECT * FROM actors_j;

* mysql+pymysql://root:***@localhost:3306/sakila
7 rows affected.

[(119, 'WARREN', 'JACKMAN'),
 (131, 'JANE', 'JACKMAN'),
 (8, 'MATTHEW', 'JOHANSSON'),
 (64, 'RAY', 'JOHANSSON'),
 (146, 'ALBERT', 'JOHANSSON'),
 (82, 'WOODY', 'JOLIE'),
 (43, 'KIRK', 'JOVOVICH')]

In [92]:
%sql DROP TABLE  actors_j

* mysql+pymysql://root:***@localhost:3306/sakila
0 rows affected.

[]

## VIEWS

In [96]:
%sql CREATE VIEW cust_vw AS SELECT customer_id, first_name, last_name, active FROM customer;

* mysql+pymysql://root:***@localhost:3306/sakila
0 rows affected.

[]

In [110]:
%sql DROP \
VIEW cust_vw

SyntaxError: invalid syntax (<ipython-input-110-0307fba5a587>, line 2)

In [102]:
%sql \
SELECT * FROM actors_j;

SyntaxError: invalid syntax (<ipython-input-102-908d5f71c13b>, line 2)